app/services/data_sync_service.rb

  def process_and_save_data(new_data)
    Rails.logger.info "Processing and saving data for #{@game_type}"

    new_data.each do |data|
      # Parse date
      draw_date = parse_date(data[:date])

      # Check if record already exists
      existing = LotteryDraw.find_by(
        game_type: @game_type,
        draw_date: draw_date
      )
---
SELECT "lottery_draws".* FROM "lottery_draws" WHERE "lottery_draws"."game_type" = $1 AND "lottery_draws"."draw_date" = $2 LIMIT $3  [["game_type", "vietlot45"], ["draw_date", "2025-09-05"], ["LIMIT", 1]]