app/controllers/dashboard_controller.rb

  def statistics
    @game_type = params[:game_type] || 'vietlot45'
    @day_of_week_stats = DayOfWeekSummary.where(game_type: @game_type).group(:day_of_week).sum(:count)
    @month_stats = MonthSummary.where(game_type: @game_type).group(:month).sum(:count)
    @even_odd_stats = EvenOddSummary.where(game_type: @game_type).group(:even_odd_type).sum(:count)
---
SELECT SUM("day_of_week_summaries"."count") AS "sum_count", "day_of_week_summaries"."day_of_week" AS "day_of_week_summaries_day_of_week" FROM "day_of_week_summaries" WHERE "day_of_week_summaries"."game_type" = $1 GROUP BY "day_of_week_summaries"."day_of_week"  [["game_type", "vietlot45"]]
SELECT SUM("month_summaries"."count") AS "sum_count", "month_summaries"."month" AS "month_summaries_month" FROM "month_summaries" WHERE "month_summaries"."game_type" = $1 GROUP BY "month_summaries"."month"  [["game_type", "vietlot45"]]
SELECT SUM("even_odd_summaries"."count") AS "sum_count", "even_odd_summaries"."even_odd_type" AS "even_odd_summaries_even_odd_type" FROM "even_odd_summaries" WHERE "even_odd_summaries"."game_type" = $1 GROUP BY "even_odd_summaries"."even_odd_type"  [["game_type", "vietlot45"]]