app/models/lottery_draw.rb

SELECT "lottery_draws".* FROM "lottery_draws" WHERE "lottery_draws"."game_type" = $1 ORDER BY "lottery_draws"."draw_date" DESC LIMIT $2  [["game_type", "vietlot45"], ["LIMIT", 1]]
---
  def self.latest_draw(game_type)
    where(game_type: game_type).order(draw_date: :desc).first