app/models/prediction.rb

SELECT MAX("predictions"."prediction_date") FROM "predictions" WHERE "predictions"."game_type" = $1  [["game_type", "vietlot45"]]
---
  def self.latest_predictions(game_type)
    latest_date = where(game_type: game_type).maximum(:prediction_date)