app/models/template_prediction.rb

SELECT MAX("template_predictions"."prediction_date") FROM "template_predictions" WHERE "template_predictions"."game_type" = $1  [["game_type", "vietlot45"]]
---
  def self.latest_predictions(game_type)
    latest_date = where(game_type: game_type).maximum(:prediction_date)